{
	"reviews" :[
		{
			"text": "Much too concerned with the structure and functions of the CIA and not with the crentral theme suggested by the title.",
			"created_at": "Mon Jan 01 13:37:52 +0000 2018"
		},
		{
			"text": "the text reveals the mentality of the CIA so that it reveals the group think which is necessary for understanding its philosophical shallowness",
			"created_at": "Mon Jan 02 13:37:52 +0000 2018"
		},
		{
			"text": "The book is what I expected to be and more....now I have confirmation. Should I believe what I read........this is another question which the reader can only answer for his / her self. The world which we all live in has many twists on the truth and lies about everything....obviously our actions may they be positive or negative will be definitely affecting the out come of our lives. The book is worth reading as far has I'm concerned.",
			"created_at": "Mon Jan 03 13:37:52 +0000 2018"
		},
		{
			"text": "I guess a gag order is a gag order. I was disappointed with this book. There wasn't anything in it that you couldn't find on line with browser search. It seemed to be more pro Cia then his video's that talked about what his family was put through. Which only a couple of pages at the end spoke about in heavy blanked out sections. I would not buy any more of his other books if they are going to be like this one. He may have put his heart and soul into it but having the Cia approve everything that was written just doesn't cut it for me. Get books that aren't censored by Cia if you want real information. Like one reviewer said, this is not a whistle blower book.",
			"created_at": "Mon Jan 04 13:37:52 +0000 2018"
		},
		{
			"text": "The book is easy to read and follow. It is very understandable along with a lot of intrigue on the workings of the CIA. It's difficult to understand the treatment by the CIA of one of their officials and long time employee. His treatment by them was off the charts and some ot his co-workers, superiors and others were off the reservation. I recommend for anyone interested in how our loyal, patriotic public servants are treated when they don't adhere to a direction that is contrary to our Country.",
			"created_at": "Mon Jan 05 13:37:52 +0000 2018"
		},
		{
			"text": "Excellent source of information about our government and how corruption take s hold when we as citizens and political oversight management fail to pay attention.",
			"created_at": "Mon Jan 06 13:37:52 +0000 2018"
		},
		{
			"text": "Lots of info.Goes in line with other books I have read.This will open your eyes to what the gov is doing that the media will not tell you.",
			"created_at": "Mon Jan 07 13:37:52 +0000 2018"
		},
		{
			"text": "The detail of what an agent goes through was intriguing. The problem is, a lot of stuff he talked about regarding 9/11 and the Iraq war was regurgitated mainstream media talking points. He really didn't expose what really went on behind the scenes like real whistleblower agents already have. Very disappointing in that sense.",
			"created_at": "Mon Jan 08 13:37:52 +0000 2018"
		}		
	]
}
